orgtest/instructions.org
#+TITLE: Capture a CloudFormation Stack with Fugue

#+PROPERTY: header-args  :dir ~/Luminal/cffun
#+PROPERTY: header-args+ :var profile="chrisc"
#+PROPERTY: header-args+ :var conductorRegion="us-east-1"
#+PROPERTY: header-args+ :var infraRegion="us-west-2"
#+PROPERTY: header-args+ :results output

* Environment

#+BEGIN_SRC sh
  aws --version
#+END_SRC

#+RESULTS:
: aws-cli/1.11.146 Python/3.6.3 Darwin/17.5.0 botocore/1.7.4

#+BEGIN_SRC sh
  qatool --version
#+END_SRC

#+RESULTS:
: qatool, version 1.8.5

#+BEGIN_SRC sh
  echo "Relevant environment variables:"
  (printenv | grep ARTIFACT) || echo "No ARTIFACT env vars"
  (printenv | grep AWS) || echo "No AWS env vars"
  (printenv | grep FUGUE) || echo "No FUGUE env vars"
#+END_SRC

#+RESULTS:
: Relevant environment variables:
: No ARTIFACT env vars
: No AWS env vars
: No FUGUE env vars

* Install Fugue

#+BEGIN_SRC sh
  qatool --profile $profile install -r $conductorRegion -m latest
#+END_SRC

#+RESULTS:
#+begin_example
AWS Account is 683892460708 (aws)

Resolving AMI id for milestone=latest region=us-east-1...
Found Conductor AMI: ami-aa8833d5

Searching for fugue-client latest...
Found fugue-client-0.56.1-4057.pkg

Downloading artifact fugue-client-0.56.1-4057.pkg...
Saved to /Users/chrisc/.qatool/repository/fugue-client-0.56.1-4057.pkg

Installing /Users/chrisc/.qatool/repository/fugue-client-0.56.1-4057.pkg...
Done

Fugue CLI version is...
Fugue Client Version: 0.54.10
Fugue CLI Version: 1.31.7-5587-9a207af1fb395e166d1a0862fc8f71974ae8fab7
VARs Version: 6.14.0-3791-19cb34e4089c7402024d221e3b227615c0d6735a
LWDoc Version: 0.48.2
LWC Version: 0.48.2
Transcriber Version: 1.6.4-1231-7f95a9635d9338b71328d74faa0c982bad3c748f
Composer Version: 0.7.2-1612

Running fugue init...
[ fugue init ] Initializing Fugue project with the following configuration:

Fugue Conductor AMI ID: ami-aa8833d5.
AWS Credentials: Profile (chrisc)
Region: us-east-1

Validating Fugue Conductor AMI ID ...
[ OK ] Provided AMI ID is valid.

Creating new fugue.yaml file ...

[ Done ] Project initialized.

Setting zFugueDebugKey in fugue.yaml...
aws:
  credentialProfile: chrisc
conductor:
  ami: ami-aa8833d5
  keyName: zFugueDebugKey
  region: us-east-1


Running fugue install...
Done
#+end_example

#+BEGIN_SRC sh
  cat fugue.yaml
#+END_SRC

#+RESULTS:
: aws:
:   credentialProfile: chrisc
: conductor:
:   ami: ami-aa8833d5
:   keyName: zFugueDebugKey
:   region: us-east-1

#+BEGIN_SRC sh
  fugue status
#+END_SRC

#+RESULTS:
:
: Fugue Status Report for chrisc/683892460708 - Fri May 4 2018 6:24pm
:
: State    Updated    Created    Account    FID/Alias    Flags    Last Message    Next Command
: -------  ---------  ---------  ---------  -----------  -------  --------------  --------------
: Nothing to see here. Go create something! :-)
:

* Create CloudFormation Stack

#+BEGIN_SRC sh
  aws --profile $profile --region $infraRegion cloudformation create-stack \
    --template-body file://DemoApp.json \
    --capabilities CAPABILITY_IAM \
    --stack-name DemoApp
#+END_SRC

#+RESULTS:
: {
:     "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2"
: }

* Make Transcriber filter file

An initial filter file is already provided as =filter.yaml=. A few resource ids must be filled in.

** List relevant CF resources

#+BEGIN_SRC sh
  f='.StackResources[] | select(.ResourceType == "AWS::AutoScaling::LaunchConfiguration" or
                                .ResourceType == "AWS::IAM::InstanceProfile" or
                                .ResourceType == "AWS::IAM::Role")'

  aws --profile $profile --region $infraRegion cloudformation describe-stack-resources \
  --stack-name DemoApp | jq -r "$f"
#+END_SRC

#+RESULTS:
#+begin_example
{
  "StackName": "DemoApp",
  "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2",
  "LogicalResourceId": "DemoAppInstanceProfile",
  "PhysicalResourceId": "DemoApp-DemoAppInstanceProfile-VFOQ0KDXSZTV",
  "ResourceType": "AWS::IAM::InstanceProfile",
  "Timestamp": "2018-05-04T22:27:36.456Z",
  "ResourceStatus": "CREATE_COMPLETE"
}
{
  "StackName": "DemoApp",
  "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2",
  "LogicalResourceId": "DemoAppLaunchConfig",
  "PhysicalResourceId": "DemoApp-DemoAppLaunchConfig-GC4WRNFG83E7",
  "ResourceType": "AWS::AutoScaling::LaunchConfiguration",
  "Timestamp": "2018-05-04T22:27:39.222Z",
  "ResourceStatus": "CREATE_COMPLETE"
}
{
  "StackName": "DemoApp",
  "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2",
  "LogicalResourceId": "DemoAppRole",
  "PhysicalResourceId": "DemoApp-DemoAppRole-DTKG79FRHCGS",
  "ResourceType": "AWS::IAM::Role",
  "Timestamp": "2018-05-04T22:25:33.654Z",
  "ResourceStatus": "CREATE_COMPLETE"
}
#+end_example

** Manually copy PhysicalResourceIds into filter.yml

#+BEGIN_SRC sh
  cat filter.yaml
#+END_SRC

#+RESULTS:
: - include: aws-autoscaling-launch-configurations:LaunchConfigurationName ~= DemoApp-DemoAppLaunchConfig-GC4WRNFG83E7
: - include: aws-dynamodb-tables:TableName ~= demo-app-table
: - include: aws-iam-instance-profiles:InstanceProfileName ~= DemoApp-DemoAppInstanceProfile-VFOQ0KDXSZTV
: - include: aws-iam-roles:RoleName ~= DemoApp-DemoAppRole-DTKG79FRHCGS
: - include: "*:Tags[].Key == Migrate"

* Transcribe

#+BEGIN_SRC sh
  fugue-transcriber --profile $profile  --region $infraRegion \
  --filter-file filter.yaml DemoApp.lw > transcriber_out.txt

  tail -n 5 transcriber_out.txt
#+END_SRC

#+RESULTS:
: Generating Ludwig...
: ------------------------------------------------------------
: Ludwig written to file: DemoApp.lw
: ------------------------------------------------------------
: Transcriber complete.

Does it compile?

#+BEGIN_SRC sh
  lwc DemoApp.lw
#+END_SRC

#+RESULTS:

