orgtest/instructions.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-05-04 Fri 19:29 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Capture a CloudFormation Stack with Fugue</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Chris Clark">
</head>
<body>
<div id="content">
<header>
<h1 class="title">Capture a CloudFormation Stack with Fugue</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6aa7ac4">1. Environment</a></li>
<li><a href="#orgf532682">2. Install Fugue</a></li>
<li><a href="#org82a1b24">3. Create CloudFormation Stack</a></li>
<li><a href="#org772945e">4. Make Transcriber filter file</a>
<ul>
<li><a href="#orgdf8f942">4.1. List relevant CF resources</a></li>
<li><a href="#org28b1631">4.2. Manually copy PhysicalResourceIds into filter.yml</a></li>
</ul>
</li>
<li><a href="#org3b2fad2">5. Transcribe</a></li>
<li><a href="#org423f48f">6. Manually edit transcribed Ludwig</a></li>
<li><a href="#orgab066b8">7. Import</a></li>
<li><a href="#org1cebe25">8. Delete the CloudFormation Stack</a>
<ul>
<li><a href="#orgfdd2f28">8.1. Add DeletionPolicy attribute "retain" to CF template</a></li>
<li><a href="#org8fcdb5e">8.2. Update CF stack with DeletionPolicy attribute "retain"</a></li>
<li><a href="#orgb154d00">8.3. Delete CF stack</a></li>
</ul>
</li>
<li><a href="#org6667fcc">9. Inspect Fugue resources</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org6aa7ac4" class="outline-2">
<h2 id="org6aa7ac4"><span class="section-number-2">1</span> Environment</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-sh">aws --version
</pre>
</div>

<pre class="example">
aws-cli/1.11.146 Python/3.6.3 Darwin/17.5.0 botocore/1.7.4

</pre>

<div class="org-src-container">
<pre class="src src-sh">qatool --version
</pre>
</div>

<pre class="example">
qatool, version 1.8.5

</pre>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"Relevant environment variables:"</span>
(printenv | grep ARTIFACT) || <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"No ARTIFACT env vars"</span>
(printenv | grep AWS) || <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"No AWS env vars"</span>
(printenv | grep FUGUE) || <span style="color: #DCDCCC; font-weight: bold;">echo</span> <span style="color: #CC9393;">"No FUGUE env vars"</span>
</pre>
</div>

<pre class="example">
Relevant environment variables:
No ARTIFACT env vars
No AWS env vars
No FUGUE env vars

</pre>
</div>
</div>

<div id="outline-container-orgf532682" class="outline-2">
<h2 id="orgf532682"><span class="section-number-2">2</span> Install Fugue</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh">qatool --profile $<span style="color: #DFAF8F;">profile</span> install -r $<span style="color: #DFAF8F;">conductorRegion</span> -m latest
</pre>
</div>

<pre class="example">
AWS Account is 683892460708 (aws)

Resolving AMI id for milestone=latest region=us-east-1...
Found Conductor AMI: ami-aa8833d5

Searching for fugue-client latest...
Found fugue-client-0.56.1-4057.pkg

Downloading artifact fugue-client-0.56.1-4057.pkg...
Saved to /Users/chrisc/.qatool/repository/fugue-client-0.56.1-4057.pkg

Installing /Users/chrisc/.qatool/repository/fugue-client-0.56.1-4057.pkg...
Done

Fugue CLI version is...
Fugue Client Version: 0.54.10
Fugue CLI Version: 1.31.7-5587-9a207af1fb395e166d1a0862fc8f71974ae8fab7
VARs Version: 6.14.0-3791-19cb34e4089c7402024d221e3b227615c0d6735a
LWDoc Version: 0.48.2
LWC Version: 0.48.2
Transcriber Version: 1.6.4-1231-7f95a9635d9338b71328d74faa0c982bad3c748f
Composer Version: 0.7.2-1612

Running fugue init...
[ fugue init ] Initializing Fugue project with the following configuration:

Fugue Conductor AMI ID: ami-aa8833d5.
AWS Credentials: Profile (chrisc)
Region: us-east-1

Validating Fugue Conductor AMI ID ...
[ OK ] Provided AMI ID is valid.

Creating new fugue.yaml file ...

[ Done ] Project initialized.

Setting zFugueDebugKey in fugue.yaml...
aws:
  credentialProfile: chrisc
conductor:
  ami: ami-aa8833d5
  keyName: zFugueDebugKey
  region: us-east-1


Running fugue install...
Done
</pre>

<div class="org-src-container">
<pre class="src src-sh">cat fugue.yaml
</pre>
</div>

<pre class="example">
aws:
  credentialProfile: chrisc
conductor:
  ami: ami-aa8833d5
  keyName: zFugueDebugKey
  region: us-east-1

</pre>

<div class="org-src-container">
<pre class="src src-sh">fugue status
</pre>
</div>

<pre class="example">

Fugue Status Report for chrisc/683892460708 - Fri May 4 2018 6:24pm

State    Updated    Created    Account    FID/Alias    Flags    Last Message    Next Command
-------  ---------  ---------  ---------  -----------  -------  --------------  --------------
Nothing to see here. Go create something! :-)


</pre>
</div>
</div>

<div id="outline-container-org82a1b24" class="outline-2">
<h2 id="org82a1b24"><span class="section-number-2">3</span> Create CloudFormation Stack</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh">aws --profile $<span style="color: #DFAF8F;">profile</span> --region $<span style="color: #DFAF8F;">infraRegion</span> cloudformation create-stack <span style="color: #CC9393;">\</span>
  --template-body file://DemoApp.json <span style="color: #CC9393;">\</span>
  --capabilities CAPABILITY_IAM <span style="color: #CC9393;">\</span>
  --stack-name DemoApp
</pre>
</div>

<pre class="example">
{
    "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2"
}

</pre>
</div>
</div>

<div id="outline-container-org772945e" class="outline-2">
<h2 id="org772945e"><span class="section-number-2">4</span> Make Transcriber filter file</h2>
<div class="outline-text-2" id="text-4">
<p>
An initial filter file is already provided as <code>filter.yaml</code>. A few resource ids must be filled in.
</p>
</div>

<div id="outline-container-orgdf8f942" class="outline-3">
<h3 id="orgdf8f942"><span class="section-number-3">4.1</span> List relevant CF resources</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #DFAF8F;">f</span>=<span style="color: #CC9393;">'.StackResources[] | select(.ResourceType == "AWS::AutoScaling::LaunchConfiguration" or</span>
<span style="color: #CC9393;">                              .ResourceType == "AWS::IAM::InstanceProfile" or</span>
<span style="color: #CC9393;">                              .ResourceType == "AWS::IAM::Role")'</span>

aws --profile $<span style="color: #DFAF8F;">profile</span> --region $<span style="color: #DFAF8F;">infraRegion</span> cloudformation describe-stack-resources <span style="color: #CC9393;">\</span>
--stack-name DemoApp | jq -r <span style="color: #CC9393;">"$f"</span>
</pre>
</div>

<pre class="example">
{
  "StackName": "DemoApp",
  "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2",
  "LogicalResourceId": "DemoAppInstanceProfile",
  "PhysicalResourceId": "DemoApp-DemoAppInstanceProfile-VFOQ0KDXSZTV",
  "ResourceType": "AWS::IAM::InstanceProfile",
  "Timestamp": "2018-05-04T22:27:36.456Z",
  "ResourceStatus": "CREATE_COMPLETE"
}
{
  "StackName": "DemoApp",
  "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2",
  "LogicalResourceId": "DemoAppLaunchConfig",
  "PhysicalResourceId": "DemoApp-DemoAppLaunchConfig-GC4WRNFG83E7",
  "ResourceType": "AWS::AutoScaling::LaunchConfiguration",
  "Timestamp": "2018-05-04T22:27:39.222Z",
  "ResourceStatus": "CREATE_COMPLETE"
}
{
  "StackName": "DemoApp",
  "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2",
  "LogicalResourceId": "DemoAppRole",
  "PhysicalResourceId": "DemoApp-DemoAppRole-DTKG79FRHCGS",
  "ResourceType": "AWS::IAM::Role",
  "Timestamp": "2018-05-04T22:25:33.654Z",
  "ResourceStatus": "CREATE_COMPLETE"
}
</pre>
</div>
</div>

<div id="outline-container-org28b1631" class="outline-3">
<h3 id="org28b1631"><span class="section-number-3">4.2</span> Manually copy PhysicalResourceIds into filter.yml</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-sh">cat filter.yaml
</pre>
</div>

<pre class="example">
- include: aws-autoscaling-launch-configurations:LaunchConfigurationName ~= DemoApp-DemoAppLaunchConfig-GC4WRNFG83E7
- include: aws-dynamodb-tables:TableName ~= demo-app-table
- include: aws-iam-instance-profiles:InstanceProfileName ~= DemoApp-DemoAppInstanceProfile-VFOQ0KDXSZTV
- include: aws-iam-roles:RoleName ~= DemoApp-DemoAppRole-DTKG79FRHCGS
- include: "*:Tags[].Key == Migrate"

</pre>
</div>
</div>
</div>

<div id="outline-container-org3b2fad2" class="outline-2">
<h2 id="org3b2fad2"><span class="section-number-2">5</span> Transcribe</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sh">fugue-transcriber --profile $<span style="color: #DFAF8F;">profile</span>  --region $<span style="color: #DFAF8F;">infraRegion</span> <span style="color: #CC9393;">\</span>
--filter-file filter.yaml DemoApp.lw &gt; transcriber_out.txt

tail -n 5 transcriber_out.txt
</pre>
</div>

<pre class="example">
Generating Ludwig...
------------------------------------------------------------
Ludwig written to file: DemoApp.lw
------------------------------------------------------------
Transcriber complete.

</pre>

<p>
Does it compile?
</p>

<div class="org-src-container">
<pre class="src src-sh">lwc DemoApp.lw
</pre>
</div>
</div>
</div>
