orgtest/instructions.org
* Manually edit transcribed Ludwig

- [X] Remove the four external EC2 instances attached to the ELB (Bug [[https://luminal.atlassian.net/browse/FUGUE-6999][FUGUE-6999]]).

Run =lwc= to ensure the composition compiles.

#+BEGIN_SRC sh
  lwc DemoApp.lw
#+END_SRC

#+RESULTS:

* Import

#+BEGIN_SRC sh
  fugue run DemoApp.lw -a DemoApp --import
#+END_SRC

#+RESULTS:
#+begin_example
[ fugue run ] Running /Users/chrisc/Luminal/cffun/DemoApp.lw

Run Details:
    Account: default
    Alias: DemoApp

Compiling Ludwig file /Users/chrisc/Luminal/cffun/DemoApp.lw
[ OK ] Successfully compiled. No errors.

Uploading compiled Ludwig composition to S3...
[ OK ] Successfully uploaded.

Requesting the Conductor to create and run process based on composition ...
[ DONE ] Process created and running.


State    Updated    Created    Account              FID                                   Alias    Flags      Last Message  Next Command
-------  ---------  ---------  -------------------  ------------------------------------  -------  -------  --------------  --------------
Running  7:01pm     7:01pm     fugue-1525472515134  906743c9-0398-4837-833c-a750e0780aaa  DemoApp  -e                       run

[ HELP ] Run the "fugue status" command to view details and status for all Fugue processes.
#+end_example

*DO NOT* proceed until the process status is =SUCCESS=.

It is very important not to delete the CF stack until Fugue has successfully imported the
infrastructure. Otherwise, you may end up in a situation where the CF stack is deleted and Fugue was not able
to import the resources, in which case nothing would be managing the resources.

#+BEGIN_SRC sh
  fugue status
#+END_SRC

#+RESULTS:
:
: Fugue Status Report for chrisc/683892460708 - Fri May 4 2018 7:02pm
:
: State    Updated    Created    Account    FID/Alias    Flags    Last Message
: -------  ---------  ---------  ---------  -----------  -------  --------------
: Running  7:01pm     7:01pm     fugue      DemoApp      -e       SUCCEEDED
:

* Delete the CloudFormation Stack

** Add DeletionPolicy attribute "retain" to CF template

Add a =DeletionPolicy= to every resource in the CloudFormation JSON file. Creates a new file called
=DemoAppRetain.json=.

#+BEGIN_SRC sh
  cat DemoApp.json | jq '.Resources[].DeletionPolicy = "Retain"' > DemoAppRetain.json
#+END_SRC

#+RESULTS:

** Update CF stack with DeletionPolicy attribute "retain"

#+BEGIN_SRC sh
  aws --profile $profile --region $infraRegion cloudformation update-stack \
    --capabilities CAPABILITY_IAM \
    --template-body file://DemoAppRetain.json \
    --stack-name DemoApp
#+END_SRC

#+RESULTS:
: {
:     "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2"
: }

Ensure update is complete.

#+BEGIN_SRC sh
  aws --profile $profile --region $infraRegion cloudformation describe-stacks \
  --stack-name DemoApp | jq '.Stacks[] | select(.StackName == "DemoApp") | .StackStatus'
#+END_SRC

#+RESULTS:
: "UPDATE_COMPLETE"

** Delete CF stack

#+BEGIN_SRC sh
  aws --profile $profile --region $infraRegion cloudformation delete-stack --stack-name DemoApp
#+END_SRC

#+RESULTS:

