orgtest/instructions.html

<div id="outline-container-org423f48f" class="outline-2">
<h2 id="org423f48f"><span class="section-number-2">6</span> Manually edit transcribed Ludwig</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li class="on"><code>[X]</code> Remove the four external EC2 instances attached to the ELB (Bug <a href="https://luminal.atlassian.net/browse/FUGUE-6999">FUGUE-6999</a>).</li>
</ul>

<p>
Run <code>lwc</code> to ensure the composition compiles.
</p>

<div class="org-src-container">
<pre class="src src-sh">lwc DemoApp.lw
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab066b8" class="outline-2">
<h2 id="orgab066b8"><span class="section-number-2">7</span> Import</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-sh">fugue run DemoApp.lw -a DemoApp --import
</pre>
</div>

<pre class="example">
[ fugue run ] Running /Users/chrisc/Luminal/cffun/DemoApp.lw

Run Details:
    Account: default
    Alias: DemoApp

Compiling Ludwig file /Users/chrisc/Luminal/cffun/DemoApp.lw
[ OK ] Successfully compiled. No errors.

Uploading compiled Ludwig composition to S3...
[ OK ] Successfully uploaded.

Requesting the Conductor to create and run process based on composition ...
[ DONE ] Process created and running.


State    Updated    Created    Account              FID                                   Alias    Flags      Last Message  Next Command
-------  ---------  ---------  -------------------  ------------------------------------  -------  -------  --------------  --------------
Running  7:01pm     7:01pm     fugue-1525472515134  906743c9-0398-4837-833c-a750e0780aaa  DemoApp  -e                       run

[ HELP ] Run the "fugue status" command to view details and status for all Fugue processes.
</pre>

<p>
<b>DO NOT</b> proceed until the process status is <code>SUCCESS</code>.
</p>

<p>
It is very important not to delete the CF stack until Fugue has successfully imported the
infrastructure. Otherwise, you may end up in a situation where the CF stack is deleted and Fugue was not able
to import the resources, in which case nothing would be managing the resources.
</p>

<div class="org-src-container">
<pre class="src src-sh">fugue status
</pre>
</div>

<pre class="example">

Fugue Status Report for chrisc/683892460708 - Fri May 4 2018 7:02pm

State    Updated    Created    Account    FID/Alias    Flags    Last Message
-------  ---------  ---------  ---------  -----------  -------  --------------
Running  7:01pm     7:01pm     fugue      DemoApp      -e       SUCCEEDED


</pre>
</div>
</div>

<div id="outline-container-org1cebe25" class="outline-2">
<h2 id="org1cebe25"><span class="section-number-2">8</span> Delete the CloudFormation Stack</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgfdd2f28" class="outline-3">
<h3 id="orgfdd2f28"><span class="section-number-3">8.1</span> Add DeletionPolicy attribute "retain" to CF template</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Add a <code>DeletionPolicy</code> to every resource in the CloudFormation JSON file. Creates a new file called
<code>DemoAppRetain.json</code>.
</p>

<div class="org-src-container">
<pre class="src src-sh">cat DemoApp.json | jq <span style="color: #CC9393;">'.Resources[].DeletionPolicy = "Retain"'</span> &gt; DemoAppRetain.json
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fcdb5e" class="outline-3">
<h3 id="org8fcdb5e"><span class="section-number-3">8.2</span> Update CF stack with DeletionPolicy attribute "retain"</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-sh">aws --profile $<span style="color: #DFAF8F;">profile</span> --region $<span style="color: #DFAF8F;">infraRegion</span> cloudformation update-stack <span style="color: #CC9393;">\</span>
  --capabilities CAPABILITY_IAM <span style="color: #CC9393;">\</span>
  --template-body file://DemoAppRetain.json <span style="color: #CC9393;">\</span>
  --stack-name DemoApp
</pre>
</div>

<pre class="example">
{
    "StackId": "arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2"
}

</pre>

<p>
Ensure update is complete.
</p>

<div class="org-src-container">
<pre class="src src-sh">aws --profile $<span style="color: #DFAF8F;">profile</span> --region $<span style="color: #DFAF8F;">infraRegion</span> cloudformation describe-stacks <span style="color: #CC9393;">\</span>
--stack-name DemoApp | jq <span style="color: #CC9393;">'.Stacks[] | select(.StackName == "DemoApp") | .StackStatus'</span>
</pre>
</div>

<pre class="example">
"UPDATE_COMPLETE"

</pre>
</div>
</div>
