orgtest/instructions.html

<div id="outline-container-orgb154d00" class="outline-3">
<h3 id="orgb154d00"><span class="section-number-3">8.3</span> Delete CF stack</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-sh">aws --profile $<span style="color: #DFAF8F;">profile</span> --region $<span style="color: #DFAF8F;">infraRegion</span> cloudformation delete-stack --stack-name DemoApp
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6667fcc" class="outline-2">
<h2 id="org6667fcc"><span class="section-number-2">9</span> Inspect Fugue resources</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">
<pre class="src src-sh">fugue status DemoApp
</pre>
</div>

<pre class="example">
AccountId:   fugue-1525472515134
FID:         906743c9-0398-4837-833c-a750e0780aaa
LastMessage: SUCCESS
Status:      SUCCEEDED
Enforcement: ENABLED
Lock Status: DISABLED

Resources:
  AutoScalingGroups:
  - AutoScalingGroupName: DemoApp-DemoAppASG-VS375PPUYLDD
    MinSize:              4
    MaxSize:              4
    AvailabilityZones:
    - us-west-2a
    - us-west-2b
    LoadBalancerNames:
    - DemoApp-DemoAppLoa-1EQF61B0ZL1K8
    Instances:
    - InstanceId:   i-0018aaba451c6cd45
      HealthStatus: Healthy
    - InstanceId:   i-05ab5828470fc5d44
      HealthStatus: Healthy
    - InstanceId:   i-0886ad6568cca5e0f
      HealthStatus: Healthy
    - InstanceId:   i-0dc11a008eae7d919
      HealthStatus: Healthy
    Tags:
      Application:                                     Fugue Demo App
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.701e3f33-1197-5646-ae27-3a212cbfca7b
      Migrate:                                         'true'
      Name:                                            demo-app-asg
      aws:cloudformation:logical-id:                   DemoAppASG
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppASG
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp

  DhcpOptions:
  - DomainName:    us-west-2.compute.internal
    Region:        us-west-2
    DhcpOptionsId: dopt-7eafff07
    Tags:
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.af9fae3c-a793-5621-a352-6a4bc1e8bb0b
      Migrate:                                         'true'
      Name:                                            demo-app-network
      aws:cloudformation:logical-id:                   DemoAppDHCPOptions
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppDHCPOptions
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp
  - DomainName:    us-west-2.compute.internal
    Region:        us-west-2
    DhcpOptionsId: dopt-1f580e66
    Tags:
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.27b22d32-d972-548c-9a53-0e188322a14e
      Migrate:                                         'true'
      Name:                                            demo-app-network
      aws:cloudformation:logical-id:                   DemoAppDHCPOptions
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/e0c17f80-4e39-11e8-b6af-503f20f2ade6
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppDHCPOptions
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/e0c17f80-4e39-11e8-b6af-503f20f2ade6
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp

  IamInstanceProfiles:
  - ARN:                 arn:aws:iam::683892460708:instance-profile/DemoApp-DemoAppInstanceProfile-VFOQ0KDXSZTV
    Region:              us-east-1
    InstanceProfileName: DemoApp-DemoAppInstanceProfile-VFOQ0KDXSZTV
    Roles:
    - ARN:      arn:aws:iam::683892460708:role/DemoApp-DemoAppRole-DTKG79FRHCGS
      RoleName: DemoApp-DemoAppRole-DTKG79FRHCGS

  IamRoles:
  - Role:
      ARN:      arn:aws:iam::683892460708:role/DemoApp-DemoAppRole-DTKG79FRHCGS
      RoleName: DemoApp-DemoAppRole-DTKG79FRHCGS
    Region: us-east-1
    Policies: []
    ManagedPolicies:
    - Arn:              arn:aws:iam::aws:policy/AmazonDynamoDBFullAccess
      AttachmentCount:  2
      CreateDate:       1423248011
      DefaultVersionId: v8
      Description:      Provides full access to Amazon DynamoDB via the AWS Management
        Console.
      IsAttachable:     true
      Path:             /
      PolicyId:         ANPAINUGF2JSOSUY76KYA
      PolicyName:       AmazonDynamoDBFullAccess
      UpdateDate:       1517955466

  InternetGateways:
  - InternetGatewayId: igw-39740b5f
    Region:            us-west-2
    Attachments:
    - State: available
      VpcId: vpc-98133de1
    Tags:
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.f51d4b17-7dc0-545b-ad69-ec8e8123ec3e
      Migrate:                                         'true'
      Name:                                            demo-app-network-IGW
      aws:cloudformation:logical-id:                   DemoAppIgw
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppIgw
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp
      network:                                         public

  LaunchConfigurations:
  - LaunchConfigurationName:  DemoApp-DemoAppLaunchConfig-GC4WRNFG83E7
    LaunchConfigurationARN:   arn:aws:autoscaling:us-west-2:683892460708:launchConfiguration:c99f9a42-1b10-4e82-bfc3-626771da5a22:launchConfigurationName/DemoApp-DemoAppLaunchConfig-GC4WRNFG83E7
    Region:                   us-west-2
    IamInstanceProfile:       DemoApp-DemoAppInstanceProfile-VFOQ0KDXSZTV
    ImageId:                  ami-b7b366d7
    InstanceType:             t2.micro
    AssociatePublicIpAddress: true
    EbsOptimized:             false
    InstanceMonitoring:
      Enabled: true
    SecurityGroups:
    - sg-fccdfb82

  LoadBalancers:
  - LoadBalancer:
      LoadBalancerName: DemoApp-DemoAppLoa-1EQF61B0ZL1K8
      DNSName:          DemoApp-DemoAppLoa-1EQF61B0ZL1K8-196277331.us-west-2.elb.amazonaws.com
      VPCId:            vpc-98133de1
      AvailabilityZones:
      - us-west-2a
      - us-west-2b
      Scheme:           internet-facing
      SourceSecurityGroup:
        GroupName:  DemoApp-DemoAppWebSg-NXI4H0BYDHUJ
        OwnerAlias: '683892460708'
      Instances:
      - InstanceId: i-0018aaba451c6cd45
      - InstanceId: i-05ab5828470fc5d44
      - InstanceId: i-0886ad6568cca5e0f
      - InstanceId: i-0dc11a008eae7d919
      Subnets:
      - subnet-64b8311d
      - subnet-967dd6dd
      SecurityGroups:
      - sg-a9cdfbd7
      ListenerDescriptions:
      - Listener:
          InstancePort:     3000
          InstanceProtocol: HTTP
          LoadBalancerPort: 80
          Protocol:         HTTP
        PolicyNames: []
      HealthCheck:
        HealthyThreshold:   3
        Interval:           15
        Target:             TCP:3000
        Timeout:            3
        UnhealthyThreshold: 3
    Region: us-west-2
    Attributes:
      AccessLog:
        Enabled: false
      ConnectionDraining:
        Enabled: false
        Timeout: 300
      ConnectionSettings:
        IdleTimeout: 60
      CrossZoneLoadBalancing:
        Enabled: false
    Tags:
      Application:                                     Fugue Demo App
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.1e3a17fa-4801-5aa2-9133-a003758f96e4
      Migrate:                                         'true'
      Name:                                            demo-app-elb
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppLoadBalancer
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp

  NetworkAcls:
  - Associations:
    - NetworkAclAssociationId: aclassoc-760adc05
      NetworkAclId:            acl-e2ea599a
      SubnetId:                subnet-64b8311d
    - NetworkAclAssociationId: aclassoc-570bdd24
      NetworkAclId:            acl-e2ea599a
      SubnetId:                subnet-967dd6dd
    Entries:
    - CidrBlock:  0.0.0.0/0
      Egress:     true
      Protocol:   '-1'
      RuleAction: allow
      RuleNumber: 100
    - CidrBlock:  0.0.0.0/0
      Egress:     true
      Protocol:   '-1'
      RuleAction: deny
      RuleNumber: 32767
    - CidrBlock:  0.0.0.0/0
      Egress:     false
      Protocol:   '-1'
      RuleAction: allow
      RuleNumber: 100
    - CidrBlock:  0.0.0.0/0
      Egress:     false
      Protocol:   '-1'
      RuleAction: deny
      RuleNumber: 32767
    IsDefault:    false
    NetworkAclId: acl-e2ea599a
    Tags:
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.901bb01b-f29e-5741-a172-a091095f5715
      Migrate:                                         'true'
      Name:                                            demo-app-network-ACL
      aws:cloudformation:logical-id:                   DemoAppNetworkAcl
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppNetworkAcl
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp
      network:                                         public
    VpcId:        vpc-98133de1
    region:       us-west-2
  - Associations: []
    Entries:
    - CidrBlock:  0.0.0.0/0
      Egress:     true
      Protocol:   '-1'
      RuleAction: allow
      RuleNumber: 100
    - CidrBlock:  0.0.0.0/0
      Egress:     true
      Protocol:   '-1'
      RuleAction: deny
      RuleNumber: 32767
    - CidrBlock:  0.0.0.0/0
      Egress:     false
      Protocol:   '-1'
      RuleAction: allow
      RuleNumber: 100
    - CidrBlock:  0.0.0.0/0
      Egress:     false
      Protocol:   '-1'
      RuleAction: deny
      RuleNumber: 32767
    IsDefault:    false
    NetworkAclId: acl-6a5cea12
    Tags:
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.21161aaf-3160-5830-8536-64074b76d3f1
      Migrate:                                         'true'
      Name:                                            demo-app-network-ACL
      aws:cloudformation:logical-id:                   DemoAppNetworkAcl
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/e0c17f80-4e39-11e8-b6af-503f20f2ade6
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppNetworkAcl
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/e0c17f80-4e39-11e8-b6af-503f20f2ade6
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp
      network:                                         public
    VpcId:        vpc-16032f6f
    region:       us-west-2

  RouteTables:
  - Associations: []
    PropagatingVgws: []
    RouteTableId: rtb-26f7df5e
    Routes:
    - DestinationCidrBlock: 10.0.0.0/16
      GatewayId:            local
      Origin:               CreateRouteTable
      State:                active
    Tags:
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.d1e7116c-345d-5b8c-a0e7-408e2d168a10
      Migrate:                                         'true'
      Name:                                            demo-app-network-LOCAL-RT
      aws:cloudformation:logical-id:                   DemoAppLocalRT
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppLocalRT
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp
      network:                                         public
    VpcId:        vpc-98133de1
    region:       us-west-2
  - Associations:
    - Main:                    false
      RouteTableAssociationId: rtbassoc-ba7b32c0
      RouteTableId:            rtb-53f2da2b
      SubnetId:                subnet-64b8311d
    - Main:                    false
      RouteTableAssociationId: rtbassoc-e078319a
      RouteTableId:            rtb-53f2da2b
      SubnetId:                subnet-967dd6dd
    PropagatingVgws: []
    RouteTableId: rtb-53f2da2b
    Routes:
    - DestinationCidrBlock: 10.0.0.0/16
      GatewayId:            local
      Origin:               CreateRouteTable
      State:                active
    - DestinationCidrBlock: 0.0.0.0/0
      GatewayId:            igw-39740b5f
      Origin:               CreateRoute
      State:                active
    Tags:
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.c55acb5a-c8de-57af-9d12-e57e72ef5d25
      Migrate:                                         'true'
      Name:                                            demo-app-network-PUBLIC-RT
      aws:cloudformation:logical-id:                   DemoAppPublicRT
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppPublicRT
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp
      network:                                         public
    VpcId:        vpc-98133de1
    region:       us-west-2

  SecurityGroups:
  - Description: Allow http traffic from the ELB SG
    GroupId:     sg-fccdfb82
    GroupName:   DemoApp-DemoAppElbSg-T0BAH1VFLFB7
    IpPermissions:
    - FromPort:   3000
      IpProtocol: tcp
      IpRanges: []
      Ipv6Ranges: []
      PrefixListIds: []
      ToPort:     3000
      UserIdGroupPairs:
      - GroupId: sg-a9cdfbd7
        UserId:  '683892460708'
    IpPermissionsEgress:
    - IpProtocol: '-1'
      IpRanges:
      - CidrIp: 0.0.0.0/0
      Ipv6Ranges: []
      PrefixListIds: []
      UserIdGroupPairs: []
    OwnerId:     '683892460708'
    Tags:
      Application:                                     Fugue Demo App
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.ff76131d-fe8b-56b1-bbb6-daf2f094c10e
      Migrate:                                         'true'
      Name:                                            demo-app-web-sg
      aws:cloudformation:logical-id:                   DemoAppElbSg
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppElbSg
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp
    VpcId:       vpc-98133de1
    region:      us-west-2
  - Description: Allow http/s traffic from the Internet
    GroupId:     sg-a9cdfbd7
    GroupName:   DemoApp-DemoAppWebSg-NXI4H0BYDHUJ
    IpPermissions:
    - FromPort:   80
      IpProtocol: tcp
      IpRanges:
      - CidrIp: 0.0.0.0/0
      Ipv6Ranges: []
      PrefixListIds: []
      ToPort:     80
      UserIdGroupPairs: []
    - FromPort:   443
      IpProtocol: tcp
      IpRanges:
      - CidrIp: 0.0.0.0/0
      Ipv6Ranges: []
      PrefixListIds: []
      ToPort:     443
      UserIdGroupPairs: []
    IpPermissionsEgress:
    - IpProtocol: '-1'
      IpRanges:
      - CidrIp: 0.0.0.0/0
      Ipv6Ranges: []
      PrefixListIds: []
      UserIdGroupPairs: []
    OwnerId:     '683892460708'
    Tags:
      Application:                                     Fugue Demo App
      Fugue ID:                                        906743c9-0398-4837-833c-a750e0780aaa.5071913d-b757-5e43-938e-1602ecd5678e
      Migrate:                                         'true'
      Name:                                            demo-app-elb-sg
      aws:cloudformation:logical-id:                   DemoAppWebSg
      aws:cloudformation:stack-id:                     arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      aws:cloudformation:stack-name:                   DemoApp
      fugue-transcriber:aws:cloudformation:logical-id: DemoAppWebSg
      fugue-transcriber:aws:cloudformation:stack-id:   arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      fugue-transcriber:aws:cloudformation:stack-name: DemoApp
    VpcId:       vpc-98133de1
    region:      us-west-2

  Subnets:
  - networkAclAssociation:
      NetworkAclAssociationId: aclassoc-760adc05
      NetworkAclId:            acl-e2ea599a
      SubnetId:                subnet-64b8311d
    region: us-west-2
    subnet:
      AssignIpv6AddressOnCreation: false
      AvailabilityZone:            us-west-2b
      AvailableIpAddressCount:     248
      CidrBlock:                   10.0.2.0/24
      DefaultForAz:                false
      Ipv6CidrBlockAssociationSet: []
      MapPublicIpOnLaunch:         false
      State:                       available
      SubnetId:                    subnet-64b8311d
      Tags:
      - Key:   Fugue ID
        Value: 906743c9-0398-4837-833c-a750e0780aaa.cf780090-e615-58be-9f71-23ce0e846063
      - Key:   aws:cloudformation:logical-id
        Value: DemoAppSubnetB
      - Key:   fugue-transcriber:aws:cloudformation:stack-id
        Value: arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      - Key:   aws:cloudformation:stack-name
        Value: DemoApp
      - Key:   fugue-transcriber:aws:cloudformation:stack-name
        Value: DemoApp
      - Key:   Migrate
        Value: 'true'
      - Key:   Name
        Value: demo-app-network-PUBLIC-SN-B
      - Key:   aws:cloudformation:stack-id
        Value: arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      - Key:   fugue-transcriber:aws:cloudformation:logical-id
        Value: DemoAppSubnetB
      - Key:   network
        Value: public
      VpcId:                       vpc-98133de1
  - networkAclAssociation:
      NetworkAclAssociationId: aclassoc-570bdd24
      NetworkAclId:            acl-e2ea599a
      SubnetId:                subnet-967dd6dd
    region: us-west-2
    subnet:
      AssignIpv6AddressOnCreation: false
      AvailabilityZone:            us-west-2a
      AvailableIpAddressCount:     248
      CidrBlock:                   10.0.1.0/24
      DefaultForAz:                false
      Ipv6CidrBlockAssociationSet: []
      MapPublicIpOnLaunch:         false
      State:                       available
      SubnetId:                    subnet-967dd6dd
      Tags:
      - Key:   Fugue ID
        Value: 906743c9-0398-4837-833c-a750e0780aaa.a389c138-019a-5c3c-96d4-091721641b73
      - Key:   aws:cloudformation:logical-id
        Value: DemoAppSubnetA
      - Key:   fugue-transcriber:aws:cloudformation:stack-id
        Value: arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      - Key:   network
        Value: public
      - Key:   fugue-transcriber:aws:cloudformation:logical-id
        Value: DemoAppSubnetA
      - Key:   Name
        Value: demo-app-network-PUBLIC-SN-A
      - Key:   Migrate
        Value: 'true'
      - Key:   aws:cloudformation:stack-id
        Value: arn:aws:cloudformation:us-west-2:683892460708:stack/DemoApp/02739170-4fea-11e8-93d8-50a68a2012f2
      - Key:   aws:cloudformation:stack-name
        Value: DemoApp
      - Key:   fugue-transcriber:aws:cloudformation:stack-name
        Value: DemoApp
      VpcId:                       vpc-98133de1

  Tables:
  - TableName:   demo-app-table
    Region:      us-west-2
    TableStatus: ACTIVE
    ProvisionedThroughput:
      ReadCapacityUnits:  10
      WriteCapacityUnits: 10

  VPCs:
  - VpcId:     vpc-98133de1
    Region:    us-west-2
    CidrBlock: 10.0.0.0/16
  - VpcId:     vpc-16032f6f
    Region:    us-west-2
    CidrBlock: 10.0.0.0/16

</pre>
</div>
</div>
</div>
</body>
</html>
